{"backend": "tensorflow", "config": {"layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32", "batch_input_shape": [null, 3001, 13, 1], "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "relu", "data_format": "channels_last", "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "name": "conv2d_2"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 32, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "name": "conv2d_3"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "name": "conv2d_4"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "relu", "kernel_constraint": null, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "name": "max_pooling2d_5", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 2000, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1000, "activation": "linear", "name": "dense_2"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 2000, "activation": "linear", "name": "dense_3"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1001, "activation": "softmax", "name": "dense_4"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.2.4", "class_name": "Sequential"}